Repository: gbsimon/keycdn-webp-optimizer
Catalog: languages/keycdn-webp-optimizer-*.po
Languages: fr_fr

source: KeyCDN WebP Settings
fr_fr: Paramètres KeyCDN WebP

source: Settings
fr_fr: Paramètres

source: Prerequisites
fr_fr: Prérequis

source: Status
fr_fr: Statut

source: Enable WebP Conversion
fr_fr: Activer la conversion WebP

source: Enhanced Mode
fr_fr: Mode amélioré

source: WebP Quality
fr_fr: Qualité WebP

source: Prerequisites for WebP Optimization
fr_fr: Prérequis pour l'optimisation WebP

source: 1. WP Offload Media Plugin
fr_fr: 1. Plugin WP Offload Media

source: Must be installed and configured
fr_fr: Doit être installé et configuré

source: Images should be offloaded to Digital Ocean Spaces or similar S3-compatible storage
fr_fr: Les images doivent être externalisées vers Digital Ocean Spaces ou un stockage S3 compatible similaire

source: 2. KeyCDN Configuration
fr_fr: 2. Configuration KeyCDN

source: Your CDN must support format conversion via URL parameters
fr_fr: Votre CDN doit supporter la conversion de format via les paramètres d'URL

source: Enable ?format=webp parameter support in your CDN settings
fr_fr: Activez le support du paramètre ?format=webp dans les paramètres de votre CDN

source: The CDN should convert images to WebP on-the-fly
fr_fr: Le CDN doit convertir les images en WebP à la volée

source: How it works:
fr_fr: Comment ça fonctionne :

source: The plugin converts <img> tags to <picture> elements
fr_fr: Le plugin convertit les balises <img> en éléments <picture>

source: Adds WebP source with ?format=webp&quality=X parameter
fr_fr: Ajoute une source WebP avec le paramètre ?format=webp&quality=X

source: Browser automatically serves WebP to supported browsers
fr_fr: Le navigateur sert automatiquement WebP aux navigateurs compatibles

source: Falls back to original format for older browsers
fr_fr: Revient au format original pour les navigateurs plus anciens

source: Configure the WebP conversion settings below.
fr_fr: Configurez les paramètres de conversion WebP ci-dessous.

source: Current Status
fr_fr: Statut actuel

source: Enabled
fr_fr: Activé

source: Disabled
fr_fr: Désactivé

source: Enhanced (handles srcset)
fr_fr: Amélioré (gère srcset)

source: Basic
fr_fr: Basique

source: Debug Mode
fr_fr: Mode débogage

source: Quality Setting
fr_fr: Paramètre de qualité

source: Enable WebP conversion for WordPress images
fr_fr: Activer la conversion WebP pour les images WordPress

source: When enabled, the plugin will automatically convert img tags to picture elements with WebP support.
fr_fr: Quand activé, le plugin convertira automatiquement les balises img en éléments picture avec support WebP.

source: Enable enhanced mode (handles srcset attributes)
fr_fr: Activer le mode amélioré (gère les attributs srcset)

source: Enhanced mode processes responsive images with srcset attributes for complete WebP coverage.
fr_fr: Le mode amélioré traite les images responsives avec des attributs srcset pour une couverture WebP complète.

source: Enable debug mode (shows conversion info in HTML comments)
fr_fr: Activer le mode débogage (affiche les informations de conversion dans les commentaires HTML)

source: Debug mode adds HTML comments showing which images were converted. Useful for troubleshooting.
fr_fr: Le mode débogage ajoute des commentaires HTML montrant quelles images ont été converties. Utile pour le dépannage.

source: WebP quality setting (1-100). Higher values mean better quality but larger file sizes.
fr_fr: Paramètre de qualité WebP (1-100). Des valeurs plus élevées signifient une meilleure qualité mais des fichiers plus volumineux.

source: KeyCDN WebP Image Optimization:
fr_fr: Optimisation d'images KeyCDN WebP :

source: Works with WP Offload Media
fr_fr: Fonctionne avec WP Offload Media

source: has been activated!
fr_fr: a été activé !

source: Configure Settings
fr_fr: Configurer les paramètres

source: KeyCDN WebP Test
fr_fr: Test KeyCDN WebP

source: Please enter a valid quality value between 1 and 100.
fr_fr: Veuillez entrer une valeur de qualité valide entre 1 et 100.

source: Debug mode will add HTML comments to your pages. This should only be enabled for troubleshooting. Continue?
fr_fr: Le mode débogage ajoutera des commentaires HTML à vos pages. Ceci ne devrait être activé que pour le dépannage. Continuer ?
